12/data/attachments/65efc531b2054357.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Stephanie_best_Friend_58824_3</nif:username>
            <nif:friendToBeRequested>soap_friends_d576d136-7db5-41f1-bde4-2b4e07f990f4</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>